#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-mNpyxEEYP6C4zqvh" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-mNpyxEEYP6C4zqvh

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
github_repository.cdktf-provider-dns_repo_7569ACCF: Refreshing state... [id=cdktf-provider-dns]
github_repository.cdktf-provider-consul_repo_96265B1E: Refreshing state... [id=cdktf-provider-consul]
github_repository.cdktf-provider-http_repo_A5B505E7: Refreshing state... [id=cdktf-provider-http]
github_repository.cdktf-provider-http-go_repo_95F76B07: Refreshing state... [id=cdktf-provider-http-go]
github_repository.cdktf-provider-consul-go_repo_D34DFDA8: Refreshing state... [id=cdktf-provider-consul-go]
data.github_team.cdktf-team-cdktf: Reading...
github_repository.cdktf-provider-azurestack-go_repo_1765C450: Refreshing state... [id=cdktf-provider-azurestack-go]
github_repository.cdktf-provider-nomad-go_repo_B7F9DDF8: Refreshing state... [id=cdktf-provider-nomad-go]
github_repository.cdktf-provider-hcp-go_repo_CB8E678C: Refreshing state... [id=cdktf-provider-hcp-go]
github_repository.cdktf-provider-nomad_repo_D9601687: Refreshing state... [id=cdktf-provider-nomad]
github_repository.cdktf-provider-vsphere-go_repo_FA3E7FDD: Refreshing state... [id=cdktf-provider-vsphere-go]
github_repository.cdktf-provider-dns-go_repo_C7771FC1: Refreshing state... [id=cdktf-provider-dns-go]
github_repository.cdktf-provider-boundary-go_repo_75E89202: Refreshing state... [id=cdktf-provider-boundary-go]
github_repository.cdktf-provider-vsphere_repo_D89D8AEF: Refreshing state... [id=cdktf-provider-vsphere]
github_repository.cdktf-provider-azurestack_repo_A2511D5D: Refreshing state... [id=cdktf-provider-azurestack]
github_repository.cdktf-provider-hcp_repo_AB40A74C: Refreshing state... [id=cdktf-provider-hcp]
github_repository.cdktf-provider-boundary_repo_42C67723: Refreshing state... [id=cdktf-provider-boundary]
github_issue_label.cdktf-provider-http-go_repository-setup_automerge-label_73B6D9E9: Refreshing state... [id=cdktf-provider-http-go:automerge]
github_issue_label.cdktf-provider-http-go_repository-setup_no-auto-close-label_C736DA05: Refreshing state... [id=cdktf-provider-http-go:no-auto-close]
github_repository_webhook.cdktf-provider-http-go_repository-setup_slack-webhook_FC6CE2FA: Refreshing state... [id=387361879]
github_issue_label.cdktf-provider-http-go_repository-setup_auto-approve-label_14191CC9: Refreshing state... [id=cdktf-provider-http-go:auto-approve]
github_issue_label.cdktf-provider-azurestack-go_repository-setup_auto-approve-label_94525FB8: Refreshing state... [id=cdktf-provider-azurestack-go:auto-approve]
github_issue_label.cdktf-provider-azurestack-go_repository-setup_no-auto-close-label_DF87A663: Refreshing state... [id=cdktf-provider-azurestack-go:no-auto-close]
github_issue_label.cdktf-provider-azurestack-go_repository-setup_automerge-label_054B6E09: Refreshing state... [id=cdktf-provider-azurestack-go:automerge]
github_repository_webhook.cdktf-provider-azurestack-go_repository-setup_slack-webhook_C6B8A077: Refreshing state... [id=387361873]
github_issue_label.cdktf-provider-consul-go_repository-setup_no-auto-close-label_57FCE77B: Refreshing state... [id=cdktf-provider-consul-go:no-auto-close]
github_issue_label.cdktf-provider-consul-go_repository-setup_automerge-label_DA557AD0: Refreshing state... [id=cdktf-provider-consul-go:automerge]
github_repository_webhook.cdktf-provider-consul-go_repository-setup_slack-webhook_2B71252F: Refreshing state... [id=387361710]
github_issue_label.cdktf-provider-consul-go_repository-setup_auto-approve-label_91E67C64: Refreshing state... [id=cdktf-provider-consul-go:auto-approve]
data.github_team.cdktf-team-cdktf: Read complete after 8s [id=6602018]
github_issue_label.cdktf-provider-nomad-go_repository-setup_automerge-label_4ABD51BB: Refreshing state... [id=cdktf-provider-nomad-go:automerge]
github_issue_label.cdktf-provider-nomad-go_repository-setup_auto-approve-label_03662F49: Refreshing state... [id=cdktf-provider-nomad-go:auto-approve]
github_repository_webhook.cdktf-provider-nomad-go_repository-setup_slack-webhook_6E6ABC9E: Refreshing state... [id=387361749]
github_issue_label.cdktf-provider-nomad-go_repository-setup_no-auto-close-label_2E51E8F3: Refreshing state... [id=cdktf-provider-nomad-go:no-auto-close]
github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key-passphrase_E904EE8A: Refreshing state... [id=cdktf-provider-dns:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-dns_repo_secret-twine-username_E43DF3B2: Refreshing state... [id=cdktf-provider-dns:TWINE_USERNAME]
github_actions_secret.cdktf-provider-dns_repo_secret-npm-token_3E6DF1BE: Refreshing state... [id=cdktf-provider-dns:NPM_TOKEN]
github_actions_secret.cdktf-provider-dns_repo_secret-alert-prs-slack-webhook-url_18C6A4F8: Refreshing state... [id=cdktf-provider-dns:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_webhook.cdktf-provider-dns_repository-setup_slack-webhook_EA6F708A: Refreshing state... [id=387361653]
github_actions_secret.cdktf-provider-dns_repo_secret-nuget-api-key_09403616: Refreshing state... [id=cdktf-provider-dns:NUGET_API_KEY]
github_actions_secret.cdktf-provider-dns_repo_secret-maven-staging-profile-id_5AA32737: Refreshing state... [id=cdktf-provider-dns:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-dns_repo_secret-gh-token_4ECE74D2: Refreshing state... [id=cdktf-provider-dns:GH_TOKEN]
github_branch_protection.cdktf-provider-dns_repository-setup_main-protection_D94F9829: Refreshing state... [id=BPR_kwDOIIyxt84B07q3]
github_issue_label.cdktf-provider-dns_repository-setup_no-auto-close-label_D5CA4ACF: Refreshing state... [id=cdktf-provider-dns:no-auto-close]
github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_13EB1DB5: Refreshing state... [id=cdktf-provider-dns:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-dns_repo_secret-maven-gpg-private-key_557230F0: Refreshing state... [id=cdktf-provider-dns:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-dns_repo_secret-maven-username_C7D1EECD: Refreshing state... [id=cdktf-provider-dns:MAVEN_USERNAME]
github_issue_label.cdktf-provider-dns_repository-setup_automerge-label_DAD08209: Refreshing state... [id=cdktf-provider-dns:automerge]
github_actions_secret.cdktf-provider-dns_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A5FC7D9: Refreshing state... [id=cdktf-provider-dns:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-dns_repo_secret-twine-password_0BACA30E: Refreshing state... [id=cdktf-provider-dns:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-dns_repo_secret-maven-password_31CC1FEC: Refreshing state... [id=cdktf-provider-dns:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-dns_repository-setup_auto-approve-label_2FA38B7C: Refreshing state... [id=cdktf-provider-dns:auto-approve]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token_6A0C957E: Refreshing state... [id=cdktf-provider-http:GH_TOKEN]
github_actions_secret.cdktf-provider-http_repo_secret-twine-username_5A7A81AC: Refreshing state... [id=cdktf-provider-http:TWINE_USERNAME]
github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key_2E35F915: Refreshing state... [id=cdktf-provider-http:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-http_repo_secret-maven-gpg-private-key-passphrase_752286DF: Refreshing state... [id=cdktf-provider-http:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-http_repository-setup_no-auto-close-label_A7654DEF: Refreshing state... [id=cdktf-provider-http:no-auto-close]
github_actions_secret.cdktf-provider-http_repo_secret-maven-password_CEFF4E3F: Refreshing state... [id=cdktf-provider-http:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-http_repository-setup_automerge-label_43F35C14: Refreshing state... [id=cdktf-provider-http:automerge]
github_actions_secret.cdktf-provider-http_repo_secret-maven-username_C22F3D5C: Refreshing state... [id=cdktf-provider-http:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF: Refreshing state... [id=cdktf-provider-http:NUGET_API_KEY]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3F92695D: Refreshing state... [id=cdktf-provider-http:GO_GITHUB_TOKEN]
github_branch_protection.cdktf-provider-http_repository-setup_main-protection_3E4C6B8F: Refreshing state... [id=BPR_kwDOIIyyU84B07q8]
github_repository_webhook.cdktf-provider-http_repository-setup_slack-webhook_5C0A6FF4: Refreshing state... [id=387361657]
github_actions_secret.cdktf-provider-http_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5ECB4895: Refreshing state... [id=cdktf-provider-http:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-http_repo_secret-npm-token_61575784: Refreshing state... [id=cdktf-provider-http:NPM_TOKEN]
github_issue_label.cdktf-provider-http_repository-setup_auto-approve-label_EF772BB5: Refreshing state... [id=cdktf-provider-http:auto-approve]
github_actions_secret.cdktf-provider-http_repo_secret-twine-password_6B51E0D0: Refreshing state... [id=cdktf-provider-http:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-http_repo_secret-maven-staging-profile-id_17DF2C16: Refreshing state... [id=cdktf-provider-http:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-http_repo_secret-alert-prs-slack-webhook-url_36A7DF5D: Refreshing state... [id=cdktf-provider-http:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-consul_repository-setup_no-auto-close-label_A49F16B8: Refreshing state... [id=cdktf-provider-consul:no-auto-close]
github_actions_secret.cdktf-provider-consul_repo_secret-twine-username_45DEB69F: Refreshing state... [id=cdktf-provider-consul:TWINE_USERNAME]
github_issue_label.cdktf-provider-consul_repository-setup_automerge-label_1D25FEA4: Refreshing state... [id=cdktf-provider-consul:automerge]
github_actions_secret.cdktf-provider-consul_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_0A475238: Refreshing state... [id=cdktf-provider-consul:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-consul_repo_secret-maven-gpg-private-key_8DE8FF61: Refreshing state... [id=cdktf-provider-consul:MAVEN_GPG_PRIVATE_KEY]
github_branch_protection.cdktf-provider-consul_repository-setup_main-protection_53DEED06: Refreshing state... [id=BPR_kwDOIIy2Yc4B07sL]
github_actions_secret.cdktf-provider-consul_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_52120DCF: Refreshing state... [id=cdktf-provider-consul:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-consul_repo_secret-alert-prs-slack-webhook-url_F596EF4F: Refreshing state... [id=cdktf-provider-consul:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-consul_repo_secret-npm-token_EFDB343E: Refreshing state... [id=cdktf-provider-consul:NPM_TOKEN]
github_actions_secret.cdktf-provider-consul_repo_secret-twine-password_80AA85AF: Refreshing state... [id=cdktf-provider-consul:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-consul_repo_secret-nuget-api-key_88092B18: Refreshing state... [id=cdktf-provider-consul:NUGET_API_KEY]
github_issue_label.cdktf-provider-consul_repository-setup_auto-approve-label_5130E5EF: Refreshing state... [id=cdktf-provider-consul:auto-approve]
github_actions_secret.cdktf-provider-consul_repo_secret-maven-username_4960F452: Refreshing state... [id=cdktf-provider-consul:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-consul_repo_secret-maven-gpg-private-key-passphrase_3100F141: Refreshing state... [id=cdktf-provider-consul:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-consul_repo_secret-maven-staging-profile-id_0482DC90: Refreshing state... [id=cdktf-provider-consul:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-consul_repo_secret-maven-password_BA8F4065: Refreshing state... [id=cdktf-provider-consul:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-consul_repo_secret-gh-token_46C6E3C0: Refreshing state... [id=cdktf-provider-consul:GH_TOKEN]
github_repository_webhook.cdktf-provider-consul_repository-setup_slack-webhook_FA24304D: Refreshing state... [id=387361825]
github_issue_label.cdktf-provider-dns-go_repository-setup_auto-approve-label_575F9EF8: Refreshing state... [id=cdktf-provider-dns-go:auto-approve]
github_issue_label.cdktf-provider-dns-go_repository-setup_no-auto-close-label_52EF76C3: Refreshing state... [id=cdktf-provider-dns-go:no-auto-close]
github_repository_webhook.cdktf-provider-dns-go_repository-setup_slack-webhook_5B5A2D41: Refreshing state... [id=387361724]
github_issue_label.cdktf-provider-dns-go_repository-setup_automerge-label_D0850113: Refreshing state... [id=cdktf-provider-dns-go:automerge]
github_issue_label.cdktf-provider-hcp-go_repository-setup_automerge-label_0E362945: Refreshing state... [id=cdktf-provider-hcp-go:automerge]
github_repository_webhook.cdktf-provider-hcp-go_repository-setup_slack-webhook_F6119287: Refreshing state... [id=387361853]
github_issue_label.cdktf-provider-hcp-go_repository-setup_auto-approve-label_EB6DC365: Refreshing state... [id=cdktf-provider-hcp-go:auto-approve]
github_issue_label.cdktf-provider-hcp-go_repository-setup_no-auto-close-label_2751C1F5: Refreshing state... [id=cdktf-provider-hcp-go:no-auto-close]
github_issue_label.cdktf-provider-boundary-go_repository-setup_no-auto-close-label_94FD8D77: Refreshing state... [id=cdktf-provider-boundary-go:no-auto-close]
github_issue_label.cdktf-provider-boundary-go_repository-setup_auto-approve-label_9BDEBB6A: Refreshing state... [id=cdktf-provider-boundary-go:auto-approve]
github_repository_webhook.cdktf-provider-boundary-go_repository-setup_slack-webhook_22CB3B37: Refreshing state... [id=387361767]
github_issue_label.cdktf-provider-boundary-go_repository-setup_automerge-label_3FFC739B: Refreshing state... [id=cdktf-provider-boundary-go:automerge]
github_actions_secret.cdktf-provider-nomad_repo_secret-twine-username_70C2E60A: Refreshing state... [id=cdktf-provider-nomad:TWINE_USERNAME]
github_branch_protection.cdktf-provider-nomad_repository-setup_main-protection_97DF745D: Refreshing state... [id=BPR_kwDOIIy2os4B07sB]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_CD1BD6D5: Refreshing state... [id=cdktf-provider-nomad:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key_579FD942: Refreshing state... [id=cdktf-provider-nomad:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.cdktf-provider-nomad_repository-setup_auto-approve-label_DD92A4A1: Refreshing state... [id=cdktf-provider-nomad:auto-approve]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-staging-profile-id_3509C0CF: Refreshing state... [id=cdktf-provider-nomad:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-nomad_repo_secret-alert-prs-slack-webhook-url_C608766F: Refreshing state... [id=cdktf-provider-nomad:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-nomad_repository-setup_automerge-label_1AAF1662: Refreshing state... [id=cdktf-provider-nomad:automerge]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-username_F2AA1254: Refreshing state... [id=cdktf-provider-nomad:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_85BBE7DB: Refreshing state... [id=cdktf-provider-nomad:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26: Refreshing state... [id=cdktf-provider-nomad:NUGET_API_KEY]
github_actions_secret.cdktf-provider-nomad_repo_secret-npm-token_33FE3E49: Refreshing state... [id=cdktf-provider-nomad:NPM_TOKEN]
github_issue_label.cdktf-provider-nomad_repository-setup_no-auto-close-label_C240C613: Refreshing state... [id=cdktf-provider-nomad:no-auto-close]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-gpg-private-key-passphrase_92765C79: Refreshing state... [id=cdktf-provider-nomad:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-nomad_repo_secret-gh-token_7B497091: Refreshing state... [id=cdktf-provider-nomad:GH_TOKEN]
github_actions_secret.cdktf-provider-nomad_repo_secret-maven-password_CF630EBE: Refreshing state... [id=cdktf-provider-nomad:MAVEN_PASSWORD]
github_repository_webhook.cdktf-provider-nomad_repository-setup_slack-webhook_28E78340: Refreshing state... [id=387361820]
github_actions_secret.cdktf-provider-nomad_repo_secret-twine-password_6E18466C: Refreshing state... [id=cdktf-provider-nomad:TWINE_PASSWORD]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_automerge-label_0F7FF690: Refreshing state... [id=cdktf-provider-vsphere-go:automerge]
github_repository_webhook.cdktf-provider-vsphere-go_repository-setup_slack-webhook_BD37A45D: Refreshing state... [id=387361714]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_auto-approve-label_88D1659F: Refreshing state... [id=cdktf-provider-vsphere-go:auto-approve]
github_issue_label.cdktf-provider-vsphere-go_repository-setup_no-auto-close-label_CE86ADE5: Refreshing state... [id=cdktf-provider-vsphere-go:no-auto-close]
github_actions_secret.cdktf-provider-vsphere_repo_secret-npm-token_9BE8DAAC: Refreshing state... [id=cdktf-provider-vsphere:NPM_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-gpg-private-key-passphrase_2CE0EB17: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-vsphere_repo_secret-twine-username_3F52A761: Refreshing state... [id=cdktf-provider-vsphere:TWINE_USERNAME]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_B0134BB1: Refreshing state... [id=cdktf-provider-vsphere:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_C4C0CC0F: Refreshing state... [id=cdktf-provider-vsphere:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-alert-prs-slack-webhook-url_6881023D: Refreshing state... [id=cdktf-provider-vsphere:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-vsphere_repo_secret-nuget-api-key_F451A69E: Refreshing state... [id=cdktf-provider-vsphere:NUGET_API_KEY]
github_actions_secret.cdktf-provider-vsphere_repo_secret-gh-token_131FD6FA: Refreshing state... [id=cdktf-provider-vsphere:GH_TOKEN]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-username_C6C21111: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-gpg-private-key_9A98A642: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_GPG_PRIVATE_KEY]
github_issue_label.cdktf-provider-vsphere_repository-setup_auto-approve-label_26689A29: Refreshing state... [id=cdktf-provider-vsphere:auto-approve]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-staging-profile-id_4BFCB4B3: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-vsphere_repo_secret-maven-password_0A766AB6: Refreshing state... [id=cdktf-provider-vsphere:MAVEN_PASSWORD]
github_branch_protection.cdktf-provider-vsphere_repository-setup_main-protection_CDD08549: Refreshing state... [id=BPR_kwDOIIyyHM4B07rh]
github_issue_label.cdktf-provider-vsphere_repository-setup_no-auto-close-label_B47BD98F: Refreshing state... [id=cdktf-provider-vsphere:no-auto-close]
github_issue_label.cdktf-provider-vsphere_repository-setup_automerge-label_D953924C: Refreshing state... [id=cdktf-provider-vsphere:automerge]
github_actions_secret.cdktf-provider-vsphere_repo_secret-twine-password_036AE96E: Refreshing state... [id=cdktf-provider-vsphere:TWINE_PASSWORD]
github_repository_webhook.cdktf-provider-vsphere_repository-setup_slack-webhook_1C70AAF7: Refreshing state... [id=387361761]
github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-password_2824131C: Refreshing state... [id=cdktf-provider-azurestack:MAVEN_PASSWORD]
github_branch_protection.cdktf-provider-azurestack_repository-setup_main-protection_81D4955B: Refreshing state... [id=BPR_kwDOIIy1rc4B07rr]
github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_4BB7DA4C: Refreshing state... [id=cdktf-provider-azurestack:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_69896F8D: Refreshing state... [id=cdktf-provider-azurestack:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-azurestack_repo_secret-npm-token_8C3449E8: Refreshing state... [id=cdktf-provider-azurestack:NPM_TOKEN]
github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-gpg-private-key_D0827E5A: Refreshing state... [id=cdktf-provider-azurestack:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-azurestack_repo_secret-gh-token_5904600E: Refreshing state... [id=cdktf-provider-azurestack:GH_TOKEN]
github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-staging-profile-id_1B8D056B: Refreshing state... [id=cdktf-provider-azurestack:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-username_3AF76FA8: Refreshing state... [id=cdktf-provider-azurestack:MAVEN_USERNAME]
github_repository_webhook.cdktf-provider-azurestack_repository-setup_slack-webhook_02B607B9: Refreshing state... [id=387361771]
github_issue_label.cdktf-provider-azurestack_repository-setup_automerge-label_AEB596C1: Refreshing state... [id=cdktf-provider-azurestack:automerge]
github_actions_secret.cdktf-provider-azurestack_repo_secret-twine-username_868BE32B: Refreshing state... [id=cdktf-provider-azurestack:TWINE_USERNAME]
github_actions_secret.cdktf-provider-azurestack_repo_secret-nuget-api-key_130A5C7B: Refreshing state... [id=cdktf-provider-azurestack:NUGET_API_KEY]
github_actions_secret.cdktf-provider-azurestack_repo_secret-twine-password_2AA6C64E: Refreshing state... [id=cdktf-provider-azurestack:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-azurestack_repo_secret-maven-gpg-private-key-passphrase_38F97382: Refreshing state... [id=cdktf-provider-azurestack:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-azurestack_repository-setup_auto-approve-label_13BDFA9C: Refreshing state... [id=cdktf-provider-azurestack:auto-approve]
github_issue_label.cdktf-provider-azurestack_repository-setup_no-auto-close-label_6F7D6224: Refreshing state... [id=cdktf-provider-azurestack:no-auto-close]
github_actions_secret.cdktf-provider-azurestack_repo_secret-alert-prs-slack-webhook-url_3AAD6765: Refreshing state... [id=cdktf-provider-azurestack:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-hcp_repo_secret-maven-username_54C1F895: Refreshing state... [id=cdktf-provider-hcp:MAVEN_USERNAME]
github_branch_protection.cdktf-provider-hcp_repository-setup_main-protection_0178DFB5: Refreshing state... [id=BPR_kwDOIIy2jc4B07ru]
github_repository_webhook.cdktf-provider-hcp_repository-setup_slack-webhook_15DE4BD4: Refreshing state... [id=387361780]
github_issue_label.cdktf-provider-hcp_repository-setup_no-auto-close-label_3D0CB120: Refreshing state... [id=cdktf-provider-hcp:no-auto-close]
github_actions_secret.cdktf-provider-hcp_repo_secret-maven-gpg-private-key_EAB4AA00: Refreshing state... [id=cdktf-provider-hcp:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token_33FED2D5: Refreshing state... [id=cdktf-provider-hcp:GH_TOKEN]
github_actions_secret.cdktf-provider-hcp_repo_secret-twine-password_D2700318: Refreshing state... [id=cdktf-provider-hcp:TWINE_PASSWORD]
github_issue_label.cdktf-provider-hcp_repository-setup_auto-approve-label_3DAF48FE: Refreshing state... [id=cdktf-provider-hcp:auto-approve]
github_actions_secret.cdktf-provider-hcp_repo_secret-maven-staging-profile-id_CB4723FB: Refreshing state... [id=cdktf-provider-hcp:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.cdktf-provider-hcp_repo_secret-maven-password_6EB0CAFC: Refreshing state... [id=cdktf-provider-hcp:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-hcp_repo_secret-alert-prs-slack-webhook-url_2A3AF15A: Refreshing state... [id=cdktf-provider-hcp:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_2D0FF12B: Refreshing state... [id=cdktf-provider-hcp:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-hcp_repo_secret-maven-gpg-private-key-passphrase_12CFF228: Refreshing state... [id=cdktf-provider-hcp:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-hcp_repo_secret-twine-username_24984759: Refreshing state... [id=cdktf-provider-hcp:TWINE_USERNAME]
github_actions_secret.cdktf-provider-hcp_repo_secret-nuget-api-key_AC79AB1A: Refreshing state... [id=cdktf-provider-hcp:NUGET_API_KEY]
github_actions_secret.cdktf-provider-hcp_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6C03A75F: Refreshing state... [id=cdktf-provider-hcp:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktf-provider-hcp_repository-setup_automerge-label_9B0ED127: Refreshing state... [id=cdktf-provider-hcp:automerge]
github_actions_secret.cdktf-provider-hcp_repo_secret-npm-token_784C5AF6: Refreshing state... [id=cdktf-provider-hcp:NPM_TOKEN]
github_team_repository.cdktf-provider-vsphere_repository-setup_managing-team_1B7AD732: Refreshing state... [id=6602018:cdktf-provider-vsphere]
github_team_repository.cdktf-provider-dns-go_repository-setup_managing-team_72DF965A: Refreshing state... [id=6602018:cdktf-provider-dns-go]
github_team_repository.cdktf-provider-hcp-go_repository-setup_managing-team_712480EE: Refreshing state... [id=6602018:cdktf-provider-hcp-go]
github_team_repository.cdktf-provider-consul-go_repository-setup_managing-team_3479E33B: Refreshing state... [id=6602018:cdktf-provider-consul-go]
github_team_repository.cdktf-provider-hcp_repository-setup_managing-team_01804E90: Refreshing state... [id=6602018:cdktf-provider-hcp]
github_team_repository.cdktf-provider-nomad-go_repository-setup_managing-team_20C89E46: Refreshing state... [id=6602018:cdktf-provider-nomad-go]
github_team_repository.cdktf-provider-azurestack-go_repository-setup_managing-team_03EEF143: Refreshing state... [id=6602018:cdktf-provider-azurestack-go]
github_team_repository.cdktf-provider-http_repository-setup_managing-team_7133207A: Refreshing state... [id=6602018:cdktf-provider-http]
github_team_repository.cdktf-provider-vsphere-go_repository-setup_managing-team_A3CD15AC: Refreshing state... [id=6602018:cdktf-provider-vsphere-go]
github_team_repository.cdktf-provider-http-go_repository-setup_managing-team_95F7AEB4: Refreshing state... [id=6602018:cdktf-provider-http-go]
github_team_repository.cdktf-provider-azurestack_repository-setup_managing-team_73069EF1: Refreshing state... [id=6602018:cdktf-provider-azurestack]
github_team_repository.cdktf-provider-dns_repository-setup_managing-team_B80C9BCC: Refreshing state... [id=6602018:cdktf-provider-dns]
github_team_repository.cdktf-provider-boundary-go_repository-setup_managing-team_558BC970: Refreshing state... [id=6602018:cdktf-provider-boundary-go]
github_team_repository.cdktf-provider-nomad_repository-setup_managing-team_482B78AE: Refreshing state... [id=6602018:cdktf-provider-nomad]
github_team_repository.cdktf-provider-consul_repository-setup_managing-team_47C264C8: Refreshing state... [id=6602018:cdktf-provider-consul]
github_actions_secret.cdktf-provider-boundary_repo_secret-twine-username_4CEE6A24: Refreshing state... [id=cdktf-provider-boundary:TWINE_USERNAME]
github_actions_secret.cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC: Refreshing state... [id=cdktf-provider-boundary:NUGET_API_KEY]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token_6ADC2DE5: Refreshing state... [id=cdktf-provider-boundary:GH_TOKEN]
github_team_repository.cdktf-provider-boundary_repository-setup_managing-team_BEA23B63: Refreshing state... [id=6602018:cdktf-provider-boundary]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-password_AEF5308C: Refreshing state... [id=cdktf-provider-boundary:MAVEN_PASSWORD]
github_issue_label.cdktf-provider-boundary_repository-setup_auto-approve-label_5F0F3238: Refreshing state... [id=cdktf-provider-boundary:auto-approve]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key_16D71AB9: Refreshing state... [id=cdktf-provider-boundary:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-boundary_repo_secret-npm-token_4E8D698B: Refreshing state... [id=cdktf-provider-boundary:NPM_TOKEN]
github_issue_label.cdktf-provider-boundary_repository-setup_automerge-label_1959FD9E: Refreshing state... [id=cdktf-provider-boundary:automerge]
github_branch_protection.cdktf-provider-boundary_repository-setup_main-protection_1B77FF13: Refreshing state... [id=BPR_kwDOIIy5Y84B07sy]
github_actions_secret.cdktf-provider-boundary_repo_secret-twine-password_A811FEB3: Refreshing state... [id=cdktf-provider-boundary:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-staging-profile-id_36C2977B: Refreshing state... [id=cdktf-provider-boundary:MAVEN_STAGING_PROFILE_ID]
github_repository_webhook.cdktf-provider-boundary_repository-setup_slack-webhook_0401AB4E: Refreshing state... [id=387361932]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86296BA7: Refreshing state... [id=cdktf-provider-boundary:GO_GITHUB_TOKEN]
github_issue_label.cdktf-provider-boundary_repository-setup_no-auto-close-label_FE55C611: Refreshing state... [id=cdktf-provider-boundary:no-auto-close]
github_actions_secret.cdktf-provider-boundary_repo_secret-alert-prs-slack-webhook-url_07110875: Refreshing state... [id=cdktf-provider-boundary:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-username_F0193805: Refreshing state... [id=cdktf-provider-boundary:MAVEN_USERNAME]
github_actions_secret.cdktf-provider-boundary_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_7AC80464: Refreshing state... [id=cdktf-provider-boundary:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-boundary_repo_secret-maven-gpg-private-key-passphrase_95613E0D: Refreshing state... [id=cdktf-provider-boundary:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-azurestack_repo_secret-nuget-api-key_130A5C7B must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-azurestack_repo_secret-nuget-api-key_130A5C7B" {
      ~ created_at      = "2023-10-17 12:56:26 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-azurestack:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:26 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-boundary_repo_secret-nuget-api-key_F62D37DC" {
      ~ created_at      = "2023-10-17 12:56:23 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-boundary:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:23 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-consul_repo_secret-nuget-api-key_88092B18 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-consul_repo_secret-nuget-api-key_88092B18" {
      ~ created_at      = "2023-10-17 12:56:25 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-consul:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:25 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-dns_repo_secret-nuget-api-key_09403616 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-dns_repo_secret-nuget-api-key_09403616" {
      ~ created_at      = "2023-10-17 12:56:34 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-dns:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:34 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-hcp_repo_secret-nuget-api-key_AC79AB1A must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-hcp_repo_secret-nuget-api-key_AC79AB1A" {
      ~ created_at      = "2023-10-17 12:56:31 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-hcp:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:31 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-http_repo_secret-nuget-api-key_F1E662AF" {
      ~ created_at      = "2023-10-17 12:56:27 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-http:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:27 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26 must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-nomad_repo_secret-nuget-api-key_2112FF26" {
      ~ created_at      = "2023-10-17 12:56:18 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-nomad:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:18 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-vsphere_repo_secret-nuget-api-key_F451A69E must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-vsphere_repo_secret-nuget-api-key_F451A69E" {
      ~ created_at      = "2023-10-17 12:56:20 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-vsphere:NUGET_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-17 12:56:20 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.


```

</details>

*Pusher: @mutahhir, Action: `pull_request_target`, Working Directory: ``, Workflow: `Plan`*